#+TITLE: Org-babel
#+OPTIONS: ^:nil toc:nil
#+STARTUP: oddeven hideblocks

#+LaTeX: \begin{abstract}
We present a new computing environment for the authoring of both prose
and source code. In this environment a single hierarchically-organized
plain text source file may contain a variety of elements such as
source code in arbitrary programming languages, raw data, links to
images and other files, project management data, working notes, and
text for publication. Source code fragments may be executed in situ
with graphical and text output captured in, or linked to from, the
source file. Export to LaTeX, HTML, Beamer and other formats permits
working reports, presentations and manuscripts for publication to be
generated from the source file. In addition, source code extraction
(tangling) permits functioning pure code files to be extracted from
the file. This framework is implemented as an extension to the Emacs
text editor and provides a very rich set of features for working with
the source file, including natural environments for authoring both
prose and code, as well as sophisticated project management
capabilities.
#+LaTeX: \end{abstract}

*** arguments to source code blocks
    :PROPERTIES:
    :CUSTOM_ID: header-arguments
    :END:
Org-babel supports parameterisation of source code blocks, i.e.,
arguments can be passed to source code blocks, which gives them the
status of *functions*.

As a very simple example the following source code block defines a
function, using Python, that squares it's argument.

This is how this function appears in the Org-mode document
: #+source: square(x)
: #+begin_src python
: x*x
: #+end_src
and this is how the function appears when exported
#+source: square(x)
#+begin_src python
return x*x
#+end_src

This function can be called elsewhere from any location in the
document

: #+call: square(x=8)

from other source-code blocks

in the Org-mode buffer
: #+source: unsquare(y=square(x=2))
: #+begin_src ruby :var 
:   Math.sqrt(y)
: #+end_src
and exported
#+source: unsquare(y=square(x=2))
#+begin_src ruby :var 
  Math.sqrt(y)
#+end_src

including from inside of Org-mode tables using the standard Org-mode
spreadsheet syntax.

In the Org-mode buffer
: | x | square(x) |
: |---+-----------|
: | 0 |         0 |
: | 1 |         1 |
: | 2 |         4 |
: | 3 |         9 |
: #+TBLFM: $2='(sbe square (x $1))
and exported
| x | square(x) |
|---+-----------|
| 0 |         0 |
| 1 |         1 |
| 2 |         4 |
| 3 |         9 |
#+TBLFM: $2='(sbe square (x $1))

**** =:results value= (functional mode)
The 'result' of code evaluation is the *value* of the last statement
in the source code block. In functional mode, the source code block is
a function with a return value. The return value of one source code
block can be used as input for another source code block, even one in
a different language.  In this way, Org-babel becomes a
[[meta-programming-language]]. This setting is the default.
     
For example, consider the following block of python code and its
output.

In the Org-mode buffer
: #+source: ret-value
: #+begin_src ruby :results value
: puts "Hello, today's date is #{Time.now}"
: puts "Two plus two is"
: 2 + 2
: #+end_src
: 
: #+results: ret-value
: : 4
and exported
#+source: ret-value
#+begin_src ruby :results value
puts "Hello, today's date is #{Time.now}"
puts "Two plus two is"
2 + 2
#+end_src

#+results: ret-value
: 4

**** =:results output= (scripting mode)
In scripting mode, Org-babel captures the text output of the source
code block and places it in the Org-mode buffer. It is called
scripting mode because the code block contains a series of commands,
and the output of each command is returned. Unlike functional mode,
the source code block itself has no return value apart from the output
of the commands it contains. (This mode will be familiar to Sweave
users).

Consider the result of evaluating this source code block with
scripting mode.

In the Org-mode buffer
: #+source: ret-output
: #+begin_src ruby :results output
: puts "Hello, today's date is #{Time.now}"
: puts "Two plus two is"
: 2 + 2
: #+end_src
: 
: #+results: ret-output
: : Hello, today's date is Tue Jan 12 20:25:28 -0700 2010
: : Two plus two is
and exported
#+source: ret-output
#+begin_src ruby :results output
puts "Hello, today's date is #{Time.now}"
puts "Two plus two is"
2 + 2
#+end_src

#+results: ret-output
: Hello, today's date is Tue Jan 12 20:25:28 -0700 2010
: Two plus two is

Here, scripting mode returned the text that Ruby sent to stdout.
Because the source code block doesn't include a =puts= statement for
the last value (2 + 2), 4 does not appear in the results.
